import pandas as pd

In [4]:
pandas.read_csv("US_births_2000-2014_SSA.csv")

NameError: name 'pandas' is not defined

In [6]:
import pandas
pandas.__version__

'2.1.4'

In [8]:
pandas.read_csv("US_births_2000-2014_SSA.csv")

      year  month  date_of_month  day_of_week  births
0     2000      1              1            6    9083
1     2000      1              2            7    8006
2     2000      1              3            1   11363
3     2000      1              4            2   13032
4     2000      1              5            3   12558
...    ...    ...            ...          ...     ...
5474  2014     12             27            6    8656
5475  2014     12             28            7    7724
5476  2014     12             29            1   12811
5477  2014     12             30            2   13634
5478  2014     12             31            3   11990

[5479 rows x 5 columns]

In [10]:
surveys_df = pandas.read_csv("US_births_2000-2014_SSA.csv")

In [12]:
surveys_df

      year  month  date_of_month  day_of_week  births
0     2000      1              1            6    9083
1     2000      1              2            7    8006
2     2000      1              3            1   11363
3     2000      1              4            2   13032
4     2000      1              5            3   12558
...    ...    ...            ...          ...     ...
5474  2014     12             27            6    8656
5475  2014     12             28            7    7724
5476  2014     12             29            1   12811
5477  2014     12             30            2   13634
5478  2014     12             31            3   11990

[5479 rows x 5 columns]

In [14]:
surveys_df.head()

   year  month  date_of_month  day_of_week  births
0  2000      1              1            6    9083
1  2000      1              2            7    8006
2  2000      1              3            1   11363
3  2000      1              4            2   13032
4  2000      1              5            3   12558

In [16]:
type(surveys_df)

pandas.core.frame.DataFrame

In [18]:
surveys_df.dtypes

year             int64
month            int64
date_of_month    int64
day_of_week      int64
births           int64
dtype: object

In [20]:
surveys_df.columns

Index(['year', 'month', 'date_of_month', 'day_of_week', 'births'], dtype='object')

In [22]:
pandas.unique(surveys_df['year'])

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014])

In [24]:
surveys_df['births'].describe()

count     5479.000000
mean     11350.068261
std       2325.821049
min       5728.000000
25%       8740.000000
50%      12343.000000
75%      13082.000000
max      16081.000000
Name: births, dtype: float64

In [26]:
grouped_data = surveys_df.groupby('year')

In [28]:
grouped_data.mean(numeric_only=True)

         month  date_of_month  day_of_week        births
year
2000  6.513661      15.756831     4.013661  11337.699454
2001  6.526027      15.720548     3.991781  11262.912329
2002  6.526027      15.720548     3.994521  11230.994521
2003  6.526027      15.720548     3.997260  11405.643836
2004  6.513661      15.756831     4.002732  11439.516393
2005  6.526027      15.720548     4.005479  11539.564384
2006  6.526027      15.720548     4.008219  11877.134247
2007  6.526027      15.720548     3.991781  12002.147945
2008  6.513661      15.756831     3.991803  11777.969945
2009  6.526027      15.720548     4.000000  11482.167123
2010  6.526027      15.720548     4.002740  11112.260274
2011  6.526027      15.720548     4.005479  10977.830137
2012  6.513661      15.756831     4.000000  10931.333333
2013  6.526027      15.720548     3.994521  10885.854795
2014  6.526027      15.720548     3.997260  10987.758904

In [30]:
year_counts = surveys_df.groupby('year')['births'].count()

In [34]:
print(year_counts)

year
2000    366
2001    365
2002    365
2003    365
2004    366
2005    365
2006    365
2007    365
2008    366
2009    365
2010    365
2011    365
2012    366
2013    365
2014    365
Name: births, dtype: int64

In [36]:
surveys_df['births']*2

0       18166
1       16012
2       22726
3       26064
4       25116
        ...
5474    17312
5475    15448
5476    25622
5477    27268
5478    23980
Name: births, Length: 5479, dtype: int64

In [38]:
surveys_df['births']*0.5

0       4541.5
1       4003.0
2       5681.5
3       6516.0
4       6279.0
         ...
5474    4328.0
5475    3862.0
5476    6405.5
5477    6817.0
5478    5995.0
Name: births, Length: 5479, dtype: float64